; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 973037 2 3 2 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 thermograph1)
))

)

; plan
1. (turn_to satellite0 star13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star13)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (turn_to satellite1 star1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
4. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
5. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 6
6. (turn_to satellite0 planet9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet9)
   goals met: 0 of 6
7. (turn_to satellite1 star13 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star13)
   goals met: 0 of 6
8. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 0 of 6
9. (take_image satellite1 star13 instrument3 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 1 of 6
10. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 1 of 6
11. (turn_to satellite1 planet10 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet10)
   goals met: 1 of 6
12. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 6
13. (take_image satellite1 planet10 instrument3 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 6
14. (turn_to satellite0 planet9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
15. (turn_to satellite1 phenomenon12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 6
16. (turn_to satellite0 phenomenon11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 6
17. (take_image satellite1 phenomenon12 instrument3 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 3 of 6
18. (turn_to satellite0 planet9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet9)
   goals met: 3 of 6
19. (turn_to satellite1 phenomenon8 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 6
20. (turn_to satellite0 phenomenon11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 6
21. (take_image satellite1 phenomenon8 instrument3 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 4 of 6
22. (turn_to satellite0 groundstation2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 6
23. (turn_to satellite1 planet9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet9)
   goals met: 4 of 6
24. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 4 of 6
25. (take_image satellite1 planet9 instrument3 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 5 of 6
26. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 6
27. (take_image satellite0 phenomenon11 instrument2 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 6
